app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "MyString"], ["email", "MyString"], ["created_at", "2016-06-22 21:23:33.571322"], ["updated_at", "2016-06-22 21:23:33.571322"]]
---
  def create
    @user = User.create(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 980190962]]
---
  def update
    @user = User.find_by_id(params[:id])